# จัดการข้อมูลด้วย Dictionary
# -สามารถเก็บข้อมูลได้หลายค่าและต่างชนิดกันได้พร้อมๆกัน
# -คุณสมบัติพิเศษที่ต่างจาก list และ Tuple คือ จะเก็บข้อมูลเป็นคู่
# -Key ซึ่งไม่ต้องซ้ำกันกับ ข้อมูล Valus ซึ่งทั้งสองข้อมูลต้องมีความสัมพันธ์กัน
# -โดย Key เป็นเปรียบเสมือนตัวชี้ (Identification) เพื่ออ้างอิงไปยังข่้อมูลจริงที่ต้องการใช้งาน

product = {101:'Fan',102:'TV',103:'Mouse'}
food = {
        (200,2555):('กุ้งเผา','หูฉลาม','ปลาทู'),
        (201,2556):('แตงโมปั่น','กล้วยปั่น','ส้มปั่น')
    }
user={
        ('somchai','1234'):"คุณสมชาย ใจดี",
        ('sompong','555'):"คุณสมชาย ยิ้มสวย",
    }
print(product[101])
print(food[(200,2555)])
print(user[('sompong','555')])